#+TITLE: 03.Numbers
* 3.1 Integer Basics


The range of values for an integer depends on the machine. The minimum range is −536,870,912 to 536,870,911 (30 bits; i.e., −2*29 to 2*29 − 1), but many machines provide a wider range. Many examples in this chapter assume the minimum integer width of 30 bits. The Lisp reader reads an integer as a sequence of digits with optional initial sign and optional final period.
# 洞见：不经意间提一句, 道出number的本质.
An integer that is out of the Emacs range is treated as a floating-point number.

#+begin_src elisp
          1               ; The integer 1.
          1.              ; The integer 1.
         +1               ; Also the integer 1.
         -1               ; The integer −1.
          9000000000000000000
                          ; The floating-point number 9e18.
          0               ; The integer 0.
         -0               ; The integer 0.
#+end_src

The syntax for integers in bases other than 10 uses '#' followed by a letter that specifies the radix: 'b' for binary, 'o' for octal, 'x' for hex, or 'radixr' to specify radix radix. Case is not significant for the letter that specifies the radix. Thus, '#binteger' reads integer in binary, and '#radixrinteger' reads integer in radix radix. Allowed values of radix run from 2 to 36. For example:

#+begin_src elisp
         #b101100 ⇒ 44
         #o54 ⇒ 44
         #x2c ⇒ 44
         #24r1k ⇒ 44
#+end_src

To understand how various functions work on integers, especially the bitwise operators (see [[3.8 Bitwise Operations on Integers]]), it is often helpful to view the numbers in their binary form.
# todo: bitwise operations需要回去看一眼.

In 30-bit binary, the decimal integer 5 looks like this:

#+begin_src elisp
0000...000101 (30 bits total)
#+end_src

(The '...' stands for enough bits to fill out a 30-bit word; in this case, '...' stands for twenty 0 bits. Later examples also use the '...' notation to make binary integers easier to read.)

The integer −1 looks like this:

#+begin_src elisp
 1111...111111 (30 bits total)
#+end_src

−1 is represented as 30 ones. (This is called two's complement notation.)

Subtracting 4 from −1 returns the negative integer −5. In binary, the decimal integer 4 is 100. Consequently, −5 looks like this:
# 洞见: 这个数值的教程有点意思了.
#+begin_src elisp
1111...111011 (30 bits total)
#+end_src

In this implementation, the largest 30-bit binary integer is 536,870,911 in decimal. In binary, it looks like this:

#+begin_src elisp
0111...111111 (30 bits total)
#+end_src

Since the arithmetic functions do not check whether integers go outside their range, when you add 1 to 536,870,911, the value is the negative integer −536,870,912:

#+begin_src elisp
         (+ 1 536870911)
              ⇒ -536870912
              ⇒ 1000...000000 (30 bits total)
#+end_src

Many of the functions described in this chapter accept markers for arguments in place of numbers. (See [[file:31.Marker.org][31.Marker]].) Since the actual arguments to such functions may be either numbers or markers, we often give these arguments the name number-or-marker. When the argument value is a marker, its position value is used and its buffer is ignored.

--- Variable: *most-positive-fixnum*

  The value of this variable is the largest integer that Emacs Lisp can handle. Typical values are 2*29 − 1 on 32-bit and 2*61 − 1 on 64-bit platforms.
  #+begin_src emacs-lisp :tangle yes
(print most-positive-fixnum)
  #+end_src

  #+RESULTS:
  : 2305843009213693951

--- Variable: *most-negative-fixnum*

  The value of this variable is the smallest integer that Emacs Lisp can handle. It is negative. Typical values are −2*29 on 32-bit and −2*61 on 64-bit platforms.


In Emacs Lisp, text characters are represented by integers. Any integer between zero and the value of =(max-char)=, inclusive, is considered to be valid as a character. See [[file:33.Non-ASCII-Characters.org::33.5 Character Codes][33.5 Character Codes]].

* 3.9 Standard Mathematical Functions
:PROPERTIES:
    :CUSTOM_ID: standard-mathematical-functions
    :END:
# 短评: 数学的基本概念. 加减乘除, 
These mathematical functions allow integers as well as floating-point numbers as arguments.

1. --- Function: *sin* arg --- Function: *cos* arg --- Function: *tan* arg


  These are the basic trigonometric functions, with argument arg measured in radians.


2. --- Function: *asin* arg


  The value of =(asin=arg=)= is a number between −pi/2 and pi/2 (inclusive) whose sine is arg. If arg is out of range (outside [−1, 1]), =asin= returns a NaN.


3. --- Function: *acos* arg


  The value of =(acos=arg=)= is a number between 0 and pi (inclusive) whose cosine is arg. If arg is out of range (outside [−1, 1]), =acos= returns a NaN.


4. --- Function: *atan* y &optional x


  The value of =(atan=y=)= is a number between −pi/2 and pi/2 (exclusive) whose tangent is y. If the optional second argument x is given, the value of =(atan y x)= is the angle in radians between the vector =[=x=,=y=]= and the =X= axis.


5. --- Function: *exp* arg


  This is the exponential function; it returns e to the power arg.
  #+begin_src emacs-lisp :tangle yes
(exp 1)
  #+end_src

  #+RESULTS:
  : 2.718281828459045


6. --- Function: *log* arg &optional base


  This function returns the logarithm of arg, with base base. If you don't specify base, the natural base e is used. If arg or base is negative, =log= returns a NaN.
  #+begin_src emacs-lisp :tangle yes
(log 10 2)
  #+end_src

  #+RESULTS:
  : 3.321928094887362


7. --- Function: *expt* x y
#+begin_src emacs-lisp :tangle yes
(expt 3 3)
#+end_src

#+RESULTS:
: 27


  This function returns x raised to power y. If both arguments are integers and y is positive, the result is an integer; in this case, overflow causes truncation, so watch out. If x is a finite negative number and y is a finite non-integer, =expt= returns a NaN.


8. --- Function: *sqrt* arg


  This returns the square root of arg. If arg is finite and less than zero, =sqrt= returns a NaN.


In addition, Emacs defines the following common mathematical constants:

--- Variable: *float-e*


  The mathematical constant e (2.71828...).


--- Variable: *float-pi*


  The mathematical constant pi (3.14159...).
# 短评: 基本的常熟
* 3.10 Random Numbers
    :PROPERTIES:
    :CUSTOM_ID: random-numbers
    :END:

A deterministic computer program cannot generate true random numbers. For most purposes, pseudo-random numbers suffice. A series of pseudo-random numbers is generated in a deterministic fashion. The numbers are not truly random, but they have certain properties that mimic a random series. For example, all possible values occur equally often in a pseudo-random series.

Pseudo-random numbers are generated from a seed value. Starting from any given seed, the =random= function always generates the same sequence of numbers. By default, Emacs initializes the random seed at startup, in such a way that the sequence of values of =random= (with overwhelming likelihood) differs in each Emacs run.

Sometimes you want the random number sequence to be repeatable. For example, when debugging a program whose behavior depends on the random number sequence, it is helpful to get the same behavior in each program run. To make the sequence repeat, execute =(random "")=. This sets the seed to a constant value for your particular Emacs executable (though it may differ for other Emacs builds). You can use other strings to choose various seed values.

--- Function: *random* &optional limit

  This function returns a pseudo-random integer. Repeated calls return a series of pseudo-random integers.
  #+begin_src emacs-lisp :tangle yes
(random "")
  #+end_src

  #+RESULTS:
  : -525573020410582217


  If limit is a positive integer, the value is chosen to be nonnegative and less than limit. Otherwise, the value might be any integer representable in Lisp, i.e., an integer between =most-negative-fixnum= and =most-positive-fixnum= (see [[3.1 Integer Basics]]).

  If limit is =t=, it means to choose a new seed as if Emacs were restarting, typically from the system entropy. On systems lacking entropy pools, choose the seed from less-random volatile data such as the current time.

  If limit is a string, it means to choose a new seed based on the string's contents.
